[{"id":1,"name":"Leighton Cook","category":"Elite","specialization":"Rouleur/ All Rounder","bio":"Leighton spent four months in Europe during the 2025 season, securing wins in Spain and Belgium. He gained valuable experience racing at a professional level, competing in numerous Belgian Pro Kermesses against World Tour riders. In March 2026, Leighton will return to Europe to race for UCI Continental team Atom 6 Bikes – Cycleur de Luxe – Auto Stroo. Alongside his racing career, Leighton coached at the Western Australian Institute of Sport for several years. He is passionate about mentoring junior West Australian cyclists.","achievements":null,"image_url":"/assets/M_FPM_LeightonCook_2_1769693385694.webp","instagram":"https://www.instagram.com/leighton.cook/","strava":"https://www.strava.com/athletes/14134394"},{"id":2,"name":"Stephen Hall","category":"Elite","specialization":"All Rounder / Sprinter","bio":"Stephen stands out as a dynamic all-rounder, excelling in both track and road disciplines. His professional cycling career spans over a decade and he has achieved the highest results both domestically and internationally. On the track he has been Australian Champion, UCI top-4 in. scratch, multiple six-day race wins. On the road he has won stages and various other formats in the USA, Australia, and other locations.","achievements":null,"image_url":"/assets/DSCF2239_1769694005540.jpg","instagram":"https://www.instagram.com/stephenhallracing/","strava":"https://www.strava.com/athletes/1025990"},{"id":3,"name":"Reece Harris","category":"Elite","specialization":"All Rounder","bio":"Reece competes both as a triathlete and cyclist. He coaches a lot of emerging triathletes supporting the next wave of up and coming elite athletes. He won the Australian national Fondo cycling championships in 2025. In 2023 and 2024 he was the open / elite WA triathlete of the year. He is passionate about helping other young athletes on their development journeys.","achievements":null,"image_url":"/assets/M_FPM_ReeceHarris_1_1769693385694.webp","instagram":"https://www.instagram.com/reece_harris9/","strava":"https://www.strava.com/athletes/3015928"},{"id":4,"name":"Tristan Nash","category":"Elite","specialization":"Climber/Puncheur","bio":"Tristan discovered his passion for cycling early, riding to school daily and racing laps around the verge. After starting competitive racing at 15, he joined Unicorn Racing in 2021 and tackled WA’s Tour of Margaret River. In 2025 Tristan claimed his first Elite National Championship and represented Australia in Europe and was recently named Australian Cyclo-Cross Athlete of the year. In 2026 Tristian is aiming for big results on the road while mentoring younger riders. Off the bike, Tristan volunteers to grow cyclocross in WA and restores cars to fund his racing dreams.","achievements":null,"image_url":"/assets/M_FPM_TristanNash_1_1769693385693.webp","instagram":"https://www.instagram.com/tristan.nashh/","strava":"https://www.strava.com/athletes/44772638"},{"id":5,"name":"Toby Price","category":"U23","specialization":"Puncheur","bio":"Toby has raced at the national junior level in cyclocross and is eager to continue his development both on and off the bike. He has already enjoyed a successful summer, regularly featuring at the front of Perth criteriums and road races, often in the thick of the action. We are excited to welcome Toby as one of our Development Riders for 2026","achievements":null,"image_url":"/assets/M_FPM_TobyPrice_2_1769693385693.webp","instagram":"https://www.instagram.com/tobyprice430/","strava":"https://www.strava.com/athletes/51548260"},{"id":6,"name":"Oliver Stenning","category":"Elite","specialization":"Time Trialist","bio":"Oli Stenning has consistently delivered strong performances at national and Oceania championships. Career highlights include a silver medal in the Oceania Individual Time Trial Championships (2024) and a top 10 finish at the Australian National Time Trial Championships (2025). Oli also brings valuable experience racing at the UCI level across Asia and Europe. Oli combines his elite racing experience with a passion for developing young talent through his coaching business. Oli is a dedicated ambassador for the sport and an ideal member of Falcons Racing.","achievements":null,"image_url":"/assets/M_FPM_OliverStenning_1_1769693385693.webp","instagram":"https://www.instagram.com/olistenning/","strava":"https://www.strava.com/athletes/13725264"},{"id":7,"name":"Patryk Szczypkowski","category":"U19","specialization":"Puncheur / Climber","bio":"Pat discovered cycling through a talent identification program on the track five years ago which quickly led him to road racing. Since then, he has competed in multiple Track National Championships, earning podium finishes at the national level. In 2026, Patryk is aiming for strong results at Australia Road Nationals before heading over to race in Europe. Known as a punchy rider with a growing love for climbing, he is motivated by racing hard and jumping on the local Perth group rides.","achievements":null,"image_url":"/assets/M_FPM_PatrykSzczypkowski_1_1769693385693.webp","instagram":"https://www.instagram.com/patrykszczypkowski/","strava":"https://www.strava.com/athletes/96893633"},{"id":8,"name":"Nick Thompson","category":"Elite","specialization":"All Rounder","bio":"Nick achieved an impressive 4th place in the Ironman Pro Series for the 2025 season and secured 7th at the Ironman World Championships in Nice, France. In addition to his Ironman career, Nick competes in local Perth and domestic cycling events.","achievements":null,"image_url":"/assets/M_FPM_NickThompson_1_1769693385693.webp","instagram":"https://www.instagram.com/nick_thompson00/","strava":"https://www.strava.com/athletes/14485231"},{"id":9,"name":"Austin Webb","category":"Elite","specialization":"All Rounder","bio":"Austin has been racing both domestically and internationally for several years. He has competed in the National Championships invarious disciplines and earned several strong results at this level.","achievements":null,"image_url":"/assets/M_FPM_AustinWebb_1_1769693385692.webp","instagram":"https://www.instagram.com/austin_webb_2000/","strava":"https://www.strava.com/athletes/43649071"},{"id":10,"name":"Connor Wright","category":"U19","specialization":"Climber","bio":"Bio coming soon","achievements":null,"image_url":"/assets/DSCF2476_1769694191312.jpg","instagram":"https://www.instagram.com/c.wright8/","strava":"https://www.strava.com/athletes/50718641"}]